# 1. Реализовать класс Matrix (матрица).
# Обеспечить перегрузку конструктора класса (метод init()),
# который должен принимать данные (список списков) для формирования матрицы.
# Подсказка: матрица — система некоторых математических величин, расположенных в
# виде прямоугольной схемы.
# Примеры матриц: см. в методичке.
#
# Следующий шаг — реализовать перегрузку метода str() для вывода матрицы в привычном виде.
# Далее реализовать перегрузку метода add() для реализации операции сложения двух объектов
# класса Matrix (двух матриц). Результатом сложения должна быть новая матрица.
# Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки
# первой матрицы складываем с первым элементом первой строки второй матрицы и т.д.
class Matrix:
    value: list

    def __init__(self, value: list):
        self.value = value

    def __add__(self, other):
        rows_count = len(self.value)
        items_count = len(self.value[0])

        new_value = [
            [
                self.value[row][idx] + other.value[row][idx]
                for idx in range(items_count)
            ]
            for row in range(rows_count)
        ]

        return Matrix(new_value)

    def __str__(self):
        return "\n".join(
            str(row).strip('[]').replace(',', '')
            for row in self.value
        )


a = Matrix([
    [15, 14, 13],
    [12, 11, 10],
])

b = Matrix([
    [21, 22, 23],
    [24, 25, 26],
])

c = a + b

print(a)
print()
print(b)
print()
print(c)